# Facundo’s Dev Mac Bootstrap Brewfile

# ---------- taps ----------
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# ---------- formulae ----------
brew "git"
brew "python@3.12"
brew "docker"
brew "docker-compose"
brew "gh"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "tree"
brew "coreutils"
brew "watch"
brew "awscli"
brew "mas"

# ---------- casks (GUI apps) ----------
cask "arc"
cask "discord"
cask "docker"
cask "jetbrains-toolbox"
cask "signal"
cask "zoom"
cask "visual-studio-code"
cask "cursor"
cask "github"
cask "termius"
cask "iterm2"
cask "rectangle"
cask "font-jetbrains-mono-nerd-font"

# ---------- Mac App Store ----------
mas "Microsoft Excel", id: 462058435
